In [2]:
import numpy as np
import pandas as pd
from IPython.display import Image

In [3]:
pd.__version__

'1.4.4'

In [4]:
order_leads = pd.read_csv('https://raw.githubusercontent.com/FBosler/Medium-Data-Exploration/master/order_leads.csv',parse_dates = [3])
sales_team = pd.read_csv('https://raw.githubusercontent.com/FBosler/Medium-Data-Exploration/master/sales_team.csv',)

In [7]:
order_leads.head()

,Order Id,Company Id,Company Name,Date,Order Value,Converted
0,HZSXLI1IS9RGABZW,D0AUXPP07H6AVSGD,Melancholy Social-Role,2017-10-13,6952,0
1,582WPS3OW8T6YT0R,D0AUXPP07H6AVSGD,Melancholy Social-Role,2017-09-02,7930,0
2,KRF65MQZBOYG4Y9T,D0AUXPP07H6AVSGD,Melancholy Social-Role,2016-12-21,5538,1
3,N3EDZ5V1WGSWW828,D0AUXPP07H6AVSGD,Melancholy Social-Role,2018-06-03,1113,0
4,QXBC8COXEXGFSPLP,D0AUXPP07H6AVSGD,Melancholy Social-Role,2014-07-26,4596,0

In [8]:
sales_team.head()

        Sales Rep      Sales Rep Id            Company Name        Company Id
0  William Taylor  ZTZA0ZLYZR85PTUJ  Melancholy Social-Role  D0AUXPP07H6AVSGD
1  William Taylor  ZTZA0ZLYZR85PTUJ          Pee-Wee Pigeon  TJW99R4RWH02INII
2  William Taylor  ZTZA0ZLYZR85PTUJ     Vaginal 36-Year-Old  3S20IO1O1DYXMUNU
3  William Taylor  ZTZA0ZLYZR85PTUJ    Unhurried Musician'S  FDWW0TQRPGMVI2A7
4  William Taylor  ZTZA0ZLYZR85PTUJ     Comprehensive Lists  C30FY83UNLVBA0O3

In [9]:
set(order_leads.columns) & set(sales_team.columns)

{'Company Id', 'Company Name'}

In [10]:
order_leads.shape

(100000, 6)

In [11]:
sales_team.shape

(4619, 4)

In [12]:
order_leads.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Order Id      100000 non-null  object
 1   Company Id    100000 non-null  object
 2   Company Name  100000 non-null  object
 3   Date          100000 non-null  datetime64[ns]
 4   Order Value   100000 non-null  int64
 5   Converted     100000 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 4.6+ MB

In [14]:
set(order_leads.columns) & set(sales_team.columns)

{'Company Id', 'Company Name'}

In [16]:
df = pd.merge(order_leads, sales_team, on=['Company Id', 'Company Name'])

In [18]:
df.head()

,Order Id,Company Id,Company Name,Date,Order Value,Converted,Sales Rep,Sales Rep Id
0,HZSXLI1IS9RGABZW,D0AUXPP07H6AVSGD,Melancholy Social-Role,2017-10-13,6952,0,William Taylor,ZTZA0ZLYZR85PTUJ
1,582WPS3OW8T6YT0R,D0AUXPP07H6AVSGD,Melancholy Social-Role,2017-09-02,7930,0,William Taylor,ZTZA0ZLYZR85PTUJ
2,KRF65MQZBOYG4Y9T,D0AUXPP07H6AVSGD,Melancholy Social-Role,2016-12-21,5538,1,William Taylor,ZTZA0ZLYZR85PTUJ
3,N3EDZ5V1WGSWW828,D0AUXPP07H6AVSGD,Melancholy Social-Role,2018-06-03,1113,0,William Taylor,ZTZA0ZLYZR85PTUJ
4,QXBC8COXEXGFSPLP,D0AUXPP07H6AVSGD,Melancholy Social-Role,2014-07-26,4596,0,William Taylor,ZTZA0ZLYZR85PTUJ

In [23]:
df.Converted.dtype

dtype('int64')

In [27]:
# Select Sales complete 
df.query("Converted == 1")[['Sales Rep', 'Order Value']]

            Sales Rep  Order Value
2      William Taylor         5538
7      William Taylor         8349
13     William Taylor          913
14     William Taylor          516
16     William Taylor         5370
...               ...          ...
99986    Ida Woodward         1293
99990    Ida Woodward         9539
99992    Ida Woodward          178
99994    Ida Woodward         9359
99996    Ida Woodward          442

[16908 rows x 2 columns]

In [39]:
df.columns = df.columns.str.replace(' ', '_')

In [47]:
# This querry give the number of frequency of a sales rep in the sales rep column.
df.Sales_Rep.value_counts(ascending=True).head(1)
# df.Sales_Rep.value_counts().nsmallest(1)  (This querry gives same result as above)

Simon Hearn    15
Name: Sales_Rep, dtype: int64

In [53]:
df.groupby('Sales_Rep')['Order_Value'].

Sales_Rep
Aaron Hendrickson    1550608
Adam Sawyer          1587828
Adele Kimmel          527339
Adrian Daugherty     1841274
Adrianna Shelton      186651
                      ...
Willie Lin            254128
Willie Rau            434918
Willie Sanchez       1525229
Yvonne Jones          416388
Yvonne Lindsey        324334
Name: Order_Value, Length: 499, dtype: int64

In [74]:
# This query gives the sum of all the order value for every sales rep.
df.groupby('Sales_Rep')['Order_Value'].sum()

Sales_Rep
Aaron Hendrickson    1550608
Adam Sawyer          1587828
Adele Kimmel          527339
Adrian Daugherty     1841274
Adrianna Shelton      186651
                      ...
Willie Lin            254128
Willie Rau            434918
Willie Sanchez       1525229
Yvonne Jones          416388
Yvonne Lindsey        324334
Name: Order_Value, Length: 499, dtype: int64

In [98]:
# This query first groupby Sales_Rep and then converted, then it sums all the 0 and 1 leads for 
# a sales rep in that column, in simpler words we get all the sum of 0 and 1 lead of a single sales rep
dd = df.groupby(['Sales_Rep', 'Converted']).sum()

In [99]:
dd

                             Order_Value
Sales_Rep         Converted
Aaron Hendrickson 0              1332129
                  1               218479
Adam Sawyer       0              1342323
                  1               245505
Adele Kimmel      0               424275
...                                  ...
Willie Sanchez    1               269773
Yvonne Jones      0               332515
                  1                83873
Yvonne Lindsey    0               239328
                  1                85006

[998 rows x 1 columns]

In [95]:
# Example for Understanding the above query
dataframe = pd.DataFrame({
    'Name': ['Ali', 'Ali', 'Hamza', 'Hamza', 'Mashal'],
    'Leads': [0,0,0,1,1],
    'Amount': [1200,1300,1500,1600,1400],
    'Nick Name': ['Kaalu', 'Chuura', 'Hoshya chand', 'Baglol', 'Bawli siri']
})

In [96]:
dataframe.groupby(['Name', 'Leads']).sum()

              Amount
Name   Leads
Ali    0        2500
Hamza  0        1500
       1        1600
Mashal 1        1400

AttributeError: 'DataFrame' object has no attribute 'Converted'